---
kind: enumMember
id: F:Autodesk.Revit.DB.FittingAndAccessoryCalculationType.CalculatePressureDrop
enum: Autodesk.Revit.DB.FittingAndAccessoryCalculationType
source: html/6bc45325-d5e3-c389-d30a-39a3e6799103.htm
---
# Autodesk.Revit.DB.FittingAndAccessoryCalculationType.CalculatePressureDrop

To calculate the pressure drop of the fitting and accessory.